var chartsData = [{  
  // 성별/ 배후지 거주인구 비율 (상권분석 요약 팝업내 차트)
  name: 'smrChart01',
  type : [['pie']],
  data: [[75.4,24.6]],
  labels: ['남성', '여성'],
  datasetLabels: [['성별 / 배후지 거주인구 비율']],
  datasetColor:[[['#2C68D1','#FF7D25']]]
},{
  // 매출액/매출건 수 추이
  name: 'chart01',
  data: [[2300,2100,2500,2800,1900,1800,2100,2250,2305,2280,2300,2750],[502,480,550,570,400,360,480,550,530,528,550,570]],
  labels: ['23년3월', '23년4월', '23년5월', '23년6월', '23년7월', '23년8월', '23년9월', '23년10월', '23년11월', '23년12월', '24년1월', '24년2월'],
  datasetLabels: [['매출액'], ['매출건수']],
  datasetColor:[['#2C68D1'], ['#FF7D25']],
  yAxisID: [['yA'], ['yB']],
},{
  //점포수 추이
  name: 'chart02',
  type: [['line'], ['bar']],
  data: [[2300,2100,2500,2800,1900,1800,2100,2250,2305,2280,2300,2750],[-10,10,12,18,30,15,20,15,0,25,-15,10]],
  labels: ['23년3월', '23년4월', '23년5월', '23년6월', '23년7월', '23년8월', '23년9월', '23년10월', '23년11월', '23년12월', '24년1월', '24년2월'],
  datasetLabels: [['점포수'],['전년대비 증감률']],
  datasetColor:[['#2C68D1'], ['#FF7D25']],
  yAxisID: [['yA'], ['yB']],
},{
  //개업률/폐업율 추이
  name: 'chart03',
  data: [[2300,2100,2500,2800,1900,1800,2100,2250,2305,2280,2300,2750],[502,480,550,570,400,360,480,550,530,528,550,570]],
  labels: ['23년3월', '23년4월', '23년5월', '23년6월', '23년7월', '23년8월', '23년9월', '23년10월', '23년11월', '23년12월', '24년1월', '24년2월'],
  datasetLabels: [['개업률'], ['폐업률']],
  datasetColor:[['#2C68D1'], ['#FF7D25']],
}
,{
  //업력 추이
  name: 'chart04',
  type : [['bar'],['bar'],['bar'],['bar'],['bar'],['bar'],['line']],
  data: [[530,520,500,480,540,500,530,520,500,480,540,500],
  [120,180,150,150,210,190,120,180,150,150,210,190],
  [500,540,560,520,450,400,500,540,560,520,450,400],
  [300,310,320,350,300,280,300,310,320,350,300,280],
  [50,80,60,20,50,60,50,80,60,20,50,60],
  [50,80,60,20,50,60,50,80,60,20,50,60],
  [50,80,60,20,50,60,50,80,60,20,50,60]],
  labels: ['23년3월', '23년4월', '23년5월', '23년6월', '23년7월', '23년8월', '23년9월', '23년10월', '23년11월', '23년12월', '24년1월', '24년2월'],
  datasetLabels: [['5년이상'],['4년~5년'],['3~4년'],['2년~3년'],['1년~2년'],['1년이하'],['평균업력(월)']],
  datasetColor:[['#322F9F'],['#4466BF'],['#5B98C1'],['#84CCC2'],['#BAE98D'],['#DFF16D'],['#FFB384']],
  stacked : true,
}
,{
  //시간대별 매출액 비율
  name: 'chart05',
  data: [[0.0, 0.9, 5.9, 11.2, 17.4, 15.9, 15.3, 17.5, 13.7, 2.4],
    [0.0, 0.8, 5.1, 9.8, 15.8, 16.4, 15.5, 19.7, 14.7, 2.3],
    [0.0, 0.6, 4.9, 9.8, 16.0, 16.8, 16.1, 18.1, 14.8, 2.8],
    [0.1, 1.2, 5.5, 9.4, 16.2, 17.2, 16.0, 16.6, 14.5, 3.3]],
  labels: ['01~06시', '07~09시', '09~11시', '11~13시', '13~15시', '15~17시', '17~19시', '19~21시', '21~23시', '23~01시'],
  datasetLabels: [['가을'],['겨울'],['봄'],['여름']],
  datasetColor:[['#2C68D1'], ['#FF7D25'],['#1DC373'],['#9382FF']],  
},{
  //요일별 매출액 비율
  name: 'chart06',
  data: [[10.6, 11.4, 12.1, 12.0, 14.6, 20.0, 19.3],
    [11.3, 11.0, 12.3, 13.1, 13.9, 19.8, 18.6],
    [12.2, 11.4, 12.4, 12.1, 14.3, 19.5, 18.1],
    [11.8, 12.1, 12.5, 12.9, 14.1, 19.1, 17.5]],
  labels: ['월', '화', '수', '목', '금', '토', '일'],
  datasetLabels: [['봄'],['여름'],['가을'],['겨울']],
  datasetColor:[['#2C68D1'], ['#FF7D25'],['#1DC373'],['#9382FF']],  
},{
  //성/연령대 매출액 비율(봄)
  name: 'chart07',
  type : [['bar'],['bar']],
  data: [[1.9, 41.8, 29.0, 16.7, 8.9, 1.8],[2.8, 42.2, 26.1, 20.4, 7.4, 1.1]],
  labels: ['10대', '20대', '30대', '40대', '50대', '60대이상'],
  datasetLabels: [['여성'],['남성']],
  datasetColor:[['#2C68D1'], ['#FF7D25']],  
},{
  //성/연령대 매출액 비율(여름)
  name: 'chart08',
  type : [['bar'],['bar']],
  data: [[1.9, 41.8, 29.0, 16.7, 8.9, 1.8],[2.8, 42.2, 26.1, 20.4, 7.4, 1.1]],
  labels: ['10대', '20대', '30대', '40대', '50대', '60대이상'],
  datasetLabels: [['여성'],['남성']],
  datasetColor:[['#2C68D1'], ['#FF7D25']],  
},{
  //성/연령대 매출액 비율(가을)
  name: 'chart09',
  type : [['bar'],['bar']],
  data: [[1.9, 41.8, 29.0, 16.7, 8.9, 1.8],[2.8, 42.2, 26.1, 20.4, 7.4, 1.1]],
  labels: ['10대', '20대', '30대', '40대', '50대', '60대이상'],
  datasetLabels: [['여성'],['남성']],
  datasetColor:[['#2C68D1'], ['#FF7D25']],  
},{
  //성/연령대 매출액 비율(겨울)
  name: 'chart10',
  type : [['bar'],['bar']],
  data: [[1.9, 41.8, 29.0, 16.7, 8.9, 1.8],[2.8, 42.2, 26.1, 20.4, 7.4, 1.1]],
  labels: ['10대', '20대', '30대', '40대', '50대', '60대이상'],
  datasetLabels: [['여성'],['남성']],
  datasetColor:[['#2C68D1'], ['#FF7D25']],  
},{
  //거주인구 / 세대수 추이
  name: 'chart11',
  data: [[42000, 31000, 29000, 30500, 35000, 36000],
    [13000, 10500, 10000, 10000, 10300, 11500]],
  labels: ["상반기'21", "하반기'21", "상반기'22", "히반기'22", "상반기'23", "하반기'23"],
  datasetLabels: [['인구수'],['세대수']],
  datasetColor:[['#2C68D1'], ['#FF7D25']], 
  yAxisID: [['yA'], ['yB']], 
},{
  //유동인구 추이
  name: 'chart12',
  data: [[41000,45000,44000,39500,39700,40500,41000,40000,40000,47000,47500,50600]],
  labels: ['23년3월', '23년4월', '23년5월', '23년6월', '23년7월', '23년8월', '23년9월', '23년10월', '23년11월', '23년12월', '24년1월', '24년2월'],
  datasetLabels: [['인구수']],
  datasetColor:[['#2C68D1']],
},{
  //성/연령별 거주인구 비율
  name: 'chart13',
  type : [['bar'],['bar']],
  data: [[47.9, 113.4, 131.7, 88.5, 130.9, 151.7, 107.6],[43.0, 98.3, 130.7, 105.4, 165.4, 147.4]],
  labels: ['10세미만', '10대', '20대', '30대', '40대', '50대', '60대이상'],
  datasetLabels: [['남성'],['여성']],
  datasetColor:[['#2C68D1'], ['#FF7D25']], 
},{
  //성/연령별 유동인구 비율
  name: 'chart14',
  type : [['bar'],['bar']],
  data: [[1.9, 3.2, 8.2, 14.1, 17.1, 9.4, 3.3],[1.7, 2.9, 7.0, 10.9, 11.2, 6.3, 2.7]],
  labels: ['10세미만', '10대', '20대', '30대', '40대', '50대', '60대이상'],
  datasetLabels: [['남성'],['여성']],
  datasetColor:[['#2C68D1'], ['#FF7D25']], 
},{
  //시간대별 유동인구 비율
  name: 'chart15',
  data: [[0.0, 0.9, 5.9, 11.2, 17.4, 15.9, 15.3, 17.5, 13.7, 2.4],
    [0.0, 0.8, 5.1, 9.8, 15.8, 16.4, 15.5, 19.7, 14.7, 2.3],
    [0.0, 0.6, 4.9, 9.8, 16.0, 16.8, 16.1, 18.1, 14.8, 2.8],
    [0.1, 1.2, 5.5, 9.4, 16.2, 17.2, 16.0, 16.6, 14.5, 3.3]],
  labels: ['01~06시', '07~09시', '09~11시', '11~13시', '13~15시', '15~17시', '17~19시', '19~21시', '21~23시', '23~01시'],
  datasetLabels: [['가을'],['겨울'],['봄'],['여름']],
  datasetColor:[['#2C68D1'], ['#FF7D25'],['#1DC373'],['#9382FF']],  
},{
  //요일별 유동인구 비율
  name: 'chart16',
  data: [[10.6, 11.4, 12.1, 12.0, 14.6, 20.0, 19.3],
    [11.3, 11.0, 12.3, 13.1, 13.9, 19.8, 18.6],
    [12.2, 11.4, 12.4, 12.1, 14.3, 19.5, 18.1],
    [11.8, 12.1, 12.5, 12.9, 14.1, 19.1, 17.5]],
  labels: ['월', '화', '수', '목', '금', '토', '일'],
  datasetLabels: [['봄'],['여름'],['가을'],['겨울']],
  datasetColor:[['#2C68D1'], ['#FF7D25'],['#1DC373'],['#9382FF']],  
},{
  //주거유형별 현황
  name: 'chart17',
  type : [['pie']],
  data: [[53,14,2,20,11]],
  labels: ['아파트', '빌라/연랍', '오피스텔', '다가구주택', '단독주택'],
  datasetLabels: [['주거유형별 인구 비율']],
  datasetColor:[[['#FF9788','#FFB384','#DFF16D','#BAE98D','#84CCC2']]]
},{
  //주거유형별 세대수 추이
  name: 'chart18',
  type : [['bar'],['bar'],['bar'],['bar'],['bar'],['bar']],
  data: [[530,520,500,480,540,500],[120,180,150,150,210,190],[500,540,560,520,450,400],[300,310,320,350,300,280],[50,80,60,20,50,60]],
  labels: ["상반기'21", "하반기'21", "상반기'22", "히반기'22", "상반기'23", "하반기'23"],
  datasetLabels: [['영업경용단독주택'],['일반단독주택'],['다가구주택'],['오피스텔'],['빌라/연립'],['아파트']],
  datasetColor:[['#322F9F'],['#4466BF'],['#5B98C1'],['#84CCC2'],['#BAE98D'],['#DFF16D']],
  stacked : true,
}
];

chartsData.forEach(chartData => {
  var chartCanvas = document.getElementById(chartData.name);
  var chartCtx = chartCanvas.getContext('2d');

  // 축 설정
  var scales = {};
  if (chartData.yAxisID) {
    scales.yA = {position: 'left', type: 'linear', display: true};
    scales.yB = {position: 'right', beginAtZero: true, grid: {drawOnChartArea: false}};
  }
  if(chartData.stacked){
    scales.x = {stacked: true};
    scales.y = {stacked: true};
  }

  new Chart(chartCtx, {
    data: {
      labels: chartData.labels,
      datasets: chartData.data.map((data, index) => ({
        type: chartData.type ? chartData.type[index][0] : 'line',
        label: chartData.datasetLabels[index][0],
        data: data,
        backgroundColor: chartData.datasetColor[index][0],
        borderColor: chartData.datasetColor[index][0],
        borderWidth: chartData.type && chartData.type[index][0] === 'bar' ? 0 : 1.5,                          
        pointStyle: 'circle',
        pointRadius: 3,
        pointHoverRadius: 7, 
        tension: 0.3,
        barThickness:16,
        yAxisID: chartData.yAxisID ? chartData.yAxisID[index][0] : undefined,
      }))
    },
    options: { 
      responsive: true,
      interaction: {
          mode: 'index',
          intersect: false,
      },
      plugins: {                  
          legend: {
              labels: {
              usePointStyle: true,
              boxWidth: 5
              },
          },
      },
        scales: scales,
    }
  });
});
